# 分组机制；实现分组很简单，使用（）即可
# 分组非常重要的功能：捕获数据[捕获分组]；当从匹配好的数据中，提取【关键数据】的时候可以使用分组
# 示例：
import re

s = """
    张三：0731-8825951
"""
print(re.findall('(\d{4})-(\d{7})', s))#(\d{4}) 和 (\d{7})就分别捕获了两段数据：0731、8825951

ss = """
    <div>hi</div>
"""
print(re.findall('<div>.*?</div>', ss))   #['<div>hi</div>']
print(re.findall('<div>(.*?)</div>', ss)) #['hi']

#1、提取学号
s1 = """
    需要匹配的
    2019-5013-08
    2020 5013 08
    2021501308
    
"""
# 需要提取的
# 2019 5013 08
# 2020 5013 08
# 2021 5013 08

print(re.findall('(\d{4})[\s-]?(\d{4})[\s-]?(\d{2})', s1))

#2、提取年月日
s2 = """
    需要匹配的
    2020-1-2
    2020-2-2
    2020-01-02
    2020/01/20
"""
# 需要提取的
# 2020 1 2
# 2020 2 2
# 2020 01 02
# 2020 01 20
print(re.findall('(\d{4})[-\/]?(\d{1,2})[-\/]?(\d{1,2})', s2))

#3、或者条件 or；加上 |符号；提取所有视频文件
s3 = """
    需要匹配的
    1.avi
    abc.mp4
    chapter1.wmv
    chapter2.rmvb
"""
# 需要提取的
# .avi
# .mp4
# .wmv
# .rmvb
print(re.findall('(.avi|.mp4|.wmv|.rmvb)', s3))

#4、非捕获分组：不会把匹配到的内容保存到分组里面，就是不需要分组里面的数据
## https://www.cnblogs.com/piperck/p/15878834.html
## 有时候，并不需要捕获某个分组的内容，但是又想使用分组的特性；
## 可以使用非捕获组(?:表达式)，从而不捕获数据，还能使用分组的功能
s4 = """
    需要匹配的
    01-75855
    0731-75855
    12345-75855
    tel:75855
"""
# 需要提取的
# 75855
# 75855
# 75855
# 75855
print(re.findall('(?:\w+)[\-:](\d+)', s4))






















